`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2022/10/06 20:02:23
// Design Name: 
// Module Name: mux_tb
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module mux_tb(
    );
    reg [9:0] a;
    reg [3:0] b;
    reg e;
    wire f;
    wire [3:0] d;
    wire [9:0] y;
    wire [6:0] c;
    wire DP;
    wire [7:0] AN;
    mux M(a,b,e,d,y,c,DP,AN);

    initial begin
        //检验e为1时的输出情况
        e=1'b1;
        b=4'b0000;
        a=10'b0000_0000_00;
        //a单位为1
        #10 a=10'b0000_0000_01;         //d=0000,y亮第0个,c显示0,f=1
        #10 a=10'b0000_0000_10;         //d=0001,y亮第1个,c显示1
        #10 a=10'b0000_0001_00;         //d=0010,y亮第2个,c显示2
        #10 a=10'b0000_0010_00;         //d=0011,y亮第3个,c显示3
        #10 a=10'b0000_0100_00;         //d=0100,y亮第4个,c显示4
        #10 a=10'b0000_1000_00;         //d=0101,y亮第5个,c显示5
        #10 a=10'b0001_0000_00;         //d=0110,y亮第6个,c显示6
        #10 a=10'b0010_0000_00;         //d=0111,y亮第7个,c显示7
        #10 a=10'b0100_0000_00;         //d=1000,y亮第8个,c显示8
        #10 a=10'b1000_0000_00;         //d=1001,y亮第9个,c显示9
        //a有多位为1,篇幅所限并不设置太多
        #10 a=10'b0000_0000_11;         //d=0001,y亮第1个,c显示1
        #10 a=10'b0000_1111_11;         //d=0101,y亮第5个,c显示5
        #10 a=10'b1111_1111_11;         //d=1001,y亮第9个,c显示9
        //检验e为0时的输出情况
        #10 e=1'b0;
        a=10'b0000_0000_00;
        #10 b=4'b0000;                  //y亮第0个，c显示0，f，d无显示
        #10 b=4'b0001;                  //y亮第1个，c显示1，f，d无显示
        #10 b=4'b0010;                  //y亮第2个，c显示2
        #10 b=4'b0011;                  //y亮第3个，c显示3
        #10 b=4'b0100;                  //y亮第4个，c显示4
        #10 b=4'b0101;                  //y亮第5个，c显示5
        #10 b=4'b0110;                  //y亮第6个，c显示6
        #10 b=4'b0111;                  //y亮第7个，c显示7
        #10 b=4'b1000;                  //y亮第8个，c显示8
        #10 b=4'b1001;                  //y亮第9个，c显示9
        //以外的情况，默认均输出0，只测试2组
        #10 b=4'b1010;                  //y不亮，c显示0
        #10 b=4'b1111;                  //y不亮，c显示0
        #10 $finish;
    end
endmodule
